app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = User.first

    if @article.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "embbed"], ["description", "coding ....."], ["created_at", "2023-12-04 10:26:44.047683"], ["updated_at", "2023-12-04 10:26:44.047683"], ["user_id", 1]]

  def update

    if @article.update(params.require(:article).permit(:title, :description))
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "title1"], ["description", "wow! something unique"], ["updated_at", "2023-11-24 09:46:58.562484"], ["id", 1]]