app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:session][:email].downcase , password: params[:session][:password])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "komal@gmail.com"], ["password", "[FILTERED]"], ["LIMIT", 1]]